       01 RDEF01-RECORD.
          05 COM-SELECT                  PIC 9(4) COMP.
             88 DETAIL1  VALUE 0.
             88 DETAIL2  VALUE 1.
          05 COM-DETAIL1.
             10 COM-NAME                 PIC X(10).
          05 COM-DETAIL2 REDEFINES COM-DETAIL1.
             10 COM-AMOUNT               PIC 9(5)V99 COMP-3.
