       01 STRU04-RECORD.
          05 COM-ITEM1                           PIC 9(5)V99 COMP-3.
          05 COM-ARRAY1 OCCURS 3 TIMES.
             10 COM-ITEM2                        PIC S9(4) COMP.
             10 COM-GROUP1.
                 15 COM-ITEM3                    PIC S9(4) COMP.
                 15 COM-ARRAY2 OCCURS 2 TIMES.
                    20 COM-ITEM4                 PIC X.
                    20 COM-ARRAY3 OCCURS 5 TIMES PIC X.
                    20 COM-ITEM5                 PIC 9(5)V99 COMP-3.
                 15 COM-ITEM6                    PIC S9(4) COMP.
             10 COM-ITEM7                        PIC S9(8) COMP.
          05 COM-ITEM8                           PIC 9(5)V99 COMP-3.
