       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARRAYGRP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 DFHCOMMAREA.
          03   ITEMS      OCCURS 4 TIMES.
               05  ITEM-DESC     PIC X(10).
               05  ITEM-NUMBER   PIC 9(9).
       PROCEDURE DIVISION.
           GOBACK.
