       PROCESS XOPTS(APOST)
       PROCESS NOSEQ LIB OPTIMIZE(FULL) ARITH(EXTEND)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BINNATUS.
      *****************************************************************
      * AUTHOR                                                        *
      * ------                                                        *
      * Fady Moussallam   fady@legsem.com                             *
      *                                                               *
      * OVERVIEW                                                      *
      * --------                                                      *
      * DPL program used to test binary numeric conversions           *
      * Test case: UNSIGNED NATIVE BINARY                             *
      *                                                               *
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      *SOURCE-COMPUTER. IBM-390 WITH DEBUGGING MODE.
       DATA DIVISION.
      *****************************************************************
      *        W O R K I N G    S T O R A G E    S E C T I O N        *
      *****************************************************************
       WORKING-STORAGE SECTION.
       
       01  WS-RESP                    PIC S9(8) COMP VALUE ZERO.
       01  WS-RESP2                   PIC S9(8) COMP VALUE ZERO.

       01  WS-EXPECTED-INCOMING-DATA.
           05 WS-UNSIGNED-NATIVE.
              10 WS-HALFWORDS.
                 15 WS-P9X4-MIN       PIC 9(4) COMP-5 VALUE 0.
                 15 WS-P9X4-LOW       PIC 9(4) COMP-5 VALUE 127.
                 15 WS-P9X4-HIGH      PIC 9(4) COMP-5 VALUE 32769.
                 15 WS-P9X4-MAX       PIC 9(4) COMP-5 VALUE 65535.
              10 WS-FULLWORDS.
                 15 WS-P9X9-MIN       PIC 9(9) COMP-5 VALUE 0.
                 15 WS-P9X9-LOW       PIC 9(9) COMP-5 VALUE 65534.
                 15 WS-P9X9-HIGH      PIC 9(9) COMP-5 VALUE 2147483649.
                 15 WS-P9X9-MAX       PIC 9(9) COMP-5 VALUE 4294967295.
              10 WS-DOUBLEWORDS.
                 15 WS-P9X18-MIN      PIC 9(18) COMP-5 VALUE 0.
                 15 WS-P9X18-LOW      PIC 9(18) COMP-5 VALUE 4294967294.
                 15 WS-P9X18-HIGH-B.
                    20 FILLER         PIC 9(9) COMP-5 VALUE 4294967294.
                    20 FILLER         PIC 9(9) COMP-5 VALUE 4294967294.
                 15 WS-P9X18-HIGH   REDEFINES WS-P9X18-HIGH-B
                                      PIC 9(18) COMP-5.
                 15 WS-P9X18-MAX-B.
                    20 FILLER         PIC 9(9) COMP-5 VALUE 4294967295.
                    20 FILLER         PIC 9(9) COMP-5 VALUE 4294967295.
                 15 WS-P9X18-MAX    REDEFINES WS-P9X18-MAX-B
                                      PIC 9(18) COMP-5.
                    
       01  FILLER.
           05 WS-PS9X4-DIS-1               PIC +9(5).
           05 WS-PS9X9-DIS-1               PIC +9(10).
           05 WS-PS9X18-DIS-1              PIC +9(20).
           05 WS-PS9X4-DIS-2               PIC +9(5).
           05 WS-PS9X9-DIS-2               PIC +9(10).
           05 WS-PS9X18-DIS-2              PIC +9(20).

      *****************************************************************
      *            L I N K A G E       S E C T I O N                  *
      *****************************************************************
       LINKAGE SECTION.
       01 DFHCOMMAREA.
           05 LS-UNSIGNED-NATIVE.
              10 LS-HALFWORDS.
                 15 LS-P9X4-MIN             PIC 9(4) COMP-5.
                 15 LS-P9X4-LOW             PIC 9(4) COMP-5.
                 15 LS-P9X4-HIGH            PIC 9(4) COMP-5.
                 15 LS-P9X4-MAX             PIC 9(4) COMP-5.
              10 LS-FULLWORDS.
                 15 LS-P9X9-MIN             PIC 9(9) COMP-5.
                 15 LS-P9X9-LOW             PIC 9(9) COMP-5.
                 15 LS-P9X9-HIGH            PIC 9(9) COMP-5.
                 15 LS-P9X9-MAX             PIC 9(9) COMP-5.
              10 LS-DOUBLEWORDS.
                 15 LS-P9X18-MIN            PIC 9(18) COMP-5.
                 15 LS-P9X18-LOW            PIC 9(18) COMP-5.
                 15 LS-P9X18-HIGH           PIC 9(18) COMP-5.
                 15 LS-P9X18-MAX            PIC 9(18) COMP-5.
          
      *****************************************************************
      *    P R O C E D U R E  D I V I S I O N   S E C T I O N         *
      *****************************************************************
       PROCEDURE DIVISION.
       
           PERFORM CHECK-INCOMING-DATA THRU
               END-CHECK-INCOMING-DATA.

           MOVE WS-EXPECTED-INCOMING-DATA TO LS-UNSIGNED-NATIVE.           
           EXEC CICS RETURN END-EXEC.
           GOBACK.
           
      *****************************************************************
      * Verify that incoming data contains what is expected           *
      *****************************************************************
       CHECK-INCOMING-DATA.
           IF LS-P9X4-MIN NOT = WS-P9X4-MIN
              COMPUTE WS-PS9X4-DIS-1 = LS-P9X4-MIN
              COMPUTE WS-PS9X4-DIS-2 = WS-P9X4-MIN
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X4-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X4-DIS-2
           END-IF.
           IF LS-P9X4-LOW NOT = WS-P9X4-LOW
              COMPUTE WS-PS9X4-DIS-1 = LS-P9X4-LOW
              COMPUTE WS-PS9X4-DIS-2 = WS-P9X4-LOW
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X4-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X4-DIS-2
           END-IF.
           IF LS-P9X4-HIGH NOT = WS-P9X4-HIGH
              COMPUTE WS-PS9X4-DIS-1 = LS-P9X4-HIGH
              COMPUTE WS-PS9X4-DIS-2 = WS-P9X4-HIGH
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X4-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X4-DIS-2
           END-IF.
           IF LS-P9X4-MAX NOT = WS-P9X4-MAX
              COMPUTE WS-PS9X4-DIS-1 = LS-P9X4-MAX
              COMPUTE WS-PS9X4-DIS-2 = WS-P9X4-MAX
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X4-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X4-DIS-2
           END-IF.

           IF LS-P9X9-MIN NOT = WS-P9X9-MIN
              COMPUTE WS-PS9X9-DIS-1 = LS-P9X9-MIN
              COMPUTE WS-PS9X9-DIS-2 = WS-P9X9-MIN
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X9-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X9-DIS-2
           END-IF.
           IF LS-P9X9-LOW NOT = WS-P9X9-LOW
              COMPUTE WS-PS9X9-DIS-1 = LS-P9X9-LOW
              COMPUTE WS-PS9X9-DIS-2 = WS-P9X9-LOW
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X9-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X9-DIS-2
           END-IF.
           IF LS-P9X9-HIGH NOT = WS-P9X9-HIGH
              COMPUTE WS-PS9X9-DIS-1 = LS-P9X9-HIGH
              COMPUTE WS-PS9X9-DIS-2 = WS-P9X9-HIGH
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X9-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X9-DIS-2
           END-IF.
           IF LS-P9X9-MAX NOT = WS-P9X9-MAX
              COMPUTE WS-PS9X9-DIS-1 = LS-P9X9-MAX
              COMPUTE WS-PS9X9-DIS-2 = WS-P9X9-MAX
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X9-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X9-DIS-2
           END-IF.
              
           IF LS-P9X18-MIN NOT = WS-P9X18-MIN
              COMPUTE WS-PS9X18-DIS-1 = LS-P9X18-MIN
              COMPUTE WS-PS9X18-DIS-2 = WS-P9X18-MIN
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X18-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X18-DIS-2
           END-IF.
           IF LS-P9X18-LOW NOT = WS-P9X18-LOW
              COMPUTE WS-PS9X18-DIS-1 = LS-P9X18-LOW
              COMPUTE WS-PS9X18-DIS-2 = WS-P9X18-LOW
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X18-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X18-DIS-2
           END-IF.
           IF LS-P9X18-HIGH NOT = WS-P9X18-HIGH
              COMPUTE WS-PS9X18-DIS-1 = LS-P9X18-HIGH
              COMPUTE WS-PS9X18-DIS-2 = WS-P9X18-HIGH
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X18-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X18-DIS-2
           END-IF.
           IF LS-P9X18-MAX NOT = WS-P9X18-MAX
              COMPUTE WS-PS9X18-DIS-1 = LS-P9X18-MAX
              COMPUTE WS-PS9X18-DIS-2 = WS-P9X18-MAX
              DISPLAY 'BINNATUS ERROR. RECEIVED=' WS-PS9X18-DIS-1
                      ' WHILE EXPECTING=' WS-PS9X18-DIS-2
           END-IF.

       END-CHECK-INCOMING-DATA.    EXIT.

