       PROCESS XOPTS(SP APOST)
       PROCESS NOSEQ LIB OPTIMIZE(FULL)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIXARCOM.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * A DPL PROGRAM WITH A FIXED SIZE COMPLEX ARRAY                 *
      *                                                               *
      *****************************************************************
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      *SOURCE-COMPUTER. IBM-390 WITH DEBUGGING MODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-I   PIC 9(4) COMP VALUE ZERO.
       01 WS-J   PIC 9(4) COMP VALUE ZERO.

       LINKAGE SECTION.
       01 DFHCOMMAREA.
          05 C-ARRAY   OCCURS 7.
             10 C-ITEM-1  PIC X(5).
             10 C-ITEM-2  PIC S9(4) BINARY.
          
       PROCEDURE DIVISION.

      *
      * First check what we received
      *
           PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 7
              IF (C-ITEM-1(WS-I) NOT = 'ABCDE')
                DISPLAY 'FIXARCOM ERROR. RECEIVED=' C-ITEM-1(WS-I)
                        ' WHILE EXPECTING=' 'ABCDE'
              END-IF
              COMPUTE WS-J = WS-I - 1
              IF (C-ITEM-2(WS-I) NOT = WS-J)
                DISPLAY 'FIXARCOM ERROR. RECEIVED=' C-ITEM-2(WS-I)
                        ' WHILE EXPECTING=' WS-J
              END-IF
           END-PERFORM.

      *
      * Create some output
      *
           PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 7
               MOVE 'FGHIJ' TO C-ITEM-1(WS-I)
               COMPUTE C-ITEM-2(WS-I) = WS-I + 7
           END-PERFORM.

           EXEC CICS RETURN END-EXEC.

           GOBACK.

       END PROGRAM FIXARCOM.
