       01 RDEF04-RECORD.
          20  FIELD-A PIC S9(15)V99 COMP-3.
          20  FIELD-B PIC S9(15)V99 COMP-3.
          20  FIELD-C REDEFINES FIELD-B PIC S9(15)V99 COMP-3.
          20  FIELD-D PIC S9(15)V99 COMP-3.
          20  FIELD-E REDEFINES FIELD-D PIC S9(15)V99 COMP-3.
          20  FIELD-F PIC S9(15)V99 COMP-3.
