       PROCESS XOPTS(SP APOST)
       PROCESS NOSEQ LIB OPTIMIZE(FULL)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDINOUT.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * A DPL PROGRAM WITH A REDEFINE                                 *
      *                                                               *
      *****************************************************************
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      *SOURCE-COMPUTER. IBM-390 WITH DEBUGGING MODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 DFHCOMMAREA.
           05 C-NUMERIC     PIC  9(4) COMP.
           05 C-BUFFER      PIC X(500).
           05 C-PARAIN REDEFINES C-BUFFER.
              10 C-SOME-INPUT PIC X(15).
           05 C-PARAOUT REDEFINES C-BUFFER.
              10 C-SOME-OUTPUT PIC 9(8).
              10 FILLER  PIC X(17).
          
       PROCEDURE DIVISION.

      *
      * First check what we received
      *
           IF (C-SOME-INPUT NOT = 'FIFTEEN CHARACT')
              DISPLAY 'REDINOUT ERROR. RECEIVED=' C-SOME-INPUT
                      ' WHILE EXPECTING=' 'FIFTEEN CHARACT'
           END-IF.
      *
      * Create some output
      *
           MOVE 14082006 TO C-SOME-OUTPUT.

           EXEC CICS RETURN END-EXEC.

           GOBACK.

       END PROGRAM REDINOUT.
