       PROCESS XOPTS(SP APOST)
       PROCESS NOSEQ LIB OPTIMIZE(FULL)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDOPERA.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * A DPL PROGRAM WITH A REDEFINE                                 *
      *                                                               *
      *****************************************************************
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      *SOURCE-COMPUTER. IBM-390 WITH DEBUGGING MODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 DFHCOMMAREA.
           05  C-FUNCTION                  PIC X(18).
               88  A-STRING     VALUE 'stringMethod'.
               88  AN-INTEGER   VALUE 'intMethod'.
           03  C-DATA                      PIC X(200).
           03  FILLER       REDEFINES C-DATA.
               05  C-STRING                PIC X(30).
               05  FILLER                  PIC X(170).
           03  FILLER       REDEFINES C-DATA.
               05  C-INTEGER               PIC S9(8).
               05  FILLER                  PIC X(192).
          
       PROCEDURE DIVISION.
           
           EVALUATE TRUE
              WHEN A-STRING
                  MOVE 'ABJADHAOUAZ' TO C-STRING
              WHEN AN-INTEGER
                  MOVE +345  TO C-INTEGER
           END-EVALUATE.

           EXEC CICS RETURN END-EXEC.

           GOBACK.

       END PROGRAM REDOPERA.
