       PROCESS XOPTS(SP APOST)
       PROCESS NOSEQ LIB OPTIMIZE(FULL)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDSIMPT.
      *****************************************************************
      * OVERVIEW                                                      *
      * --------                                                      *
      * A DPL PROGRAM WITH A REDEFINE                                 *
      *                                                               *
      *****************************************************************
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      *SOURCE-COMPUTER. IBM-390 WITH DEBUGGING MODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 DFHCOMMAREA.
           05  C-DEFINITION-1                          PIC X(18).
           05  C-DEFINITION-2 REDEFINES C-DEFINITION-1 PIC 9(18).
          
       PROCEDURE DIVISION.
           
           EXEC CICS RETURN END-EXEC.

           GOBACK.

       END PROGRAM REDSIMPT.
