       01 FLAT02-RECORD.
          05 COM-NUMBER         PIC 9(6).
          05 COM-NAME           PIC X(20).
          05 COM-AMOUNT         PIC 9(5)V99 COMP-3.
          05 COM-ARRAY OCCURS 5 TIMES PIC S9(4) COMP.
