        01  RDEF04-RECORD.
            10 OUTER-REDEFINES-LONG PIC X(10).
            10 OUTER-REDEFINES-SHORT 
                  REDEFINES OUTER-REDEFINES-LONG.
               15 INNER-REDEFINES-LONG PIC X(5).
               15 INNER-REDEFINES-SHORT
                  REDEFINES INNER-REDEFINES-LONG PIC X(3).
            10 FOOTER PIC X.